
//企业税号
const taxRegex = /(^[a-zA-Z0-9]{15}$)|(^[a-zA-Z0-9]{17}$)|(^[a-zA-Z0-9]{18}$)|(^[a-zA-Z0-9]{20}$)/
//手机号码
const mobileRegex = /^[1][3,4,5,7,8][0-9]{9}$/
//电话号码
const a = /^ (\(\d{ 3, 4 } \)|\d{ 3, 4 } -|\s)?(\d{ 7, 14 }|\d{ 5 }) $ /
//18位身份证号
const b = /^\d{17}[\d|x|X]$/
//邮箱
const c = /^\w + ([-+.]\w +)*@\w + ([-.]\w +)*\.\w + ([-.]\w +)* $ /
//中国邮政编码
const d = /^[1-9]{1}\d{5}$/
//微信号
const e = /^ [a - zA - Z]([-_a - zA - Z0 - 9]{ 5, 19})$ /
//QQ号
const f = /^[1-9]\d{4,10}$/
//车牌号含新能源车牌（不包含特种车辆）
const g = /^ (([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A - Z](([0 - 9]{ 5}[DF]) | ([DF]([A - HJ - NP - Z0 - 9])[0 - 9]{ 4 })))| ([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A - Z][A - HJ - NP - Z0 - 9]{ 4 } [A - HJ - NP - Z0 - 9挂学警港澳使领])) $ /
//IP极简
const h = /\d+\.\d+\.\d+\.\d+/
//IP 精确
const hh = /^ (?: (?: 25[0 - 5] | 2[0 - 4][0 - 9] | [01] ? [0 - 9][0 - 9] ?) \.) { 3 } (?: 25[0 - 5] | 2[0 - 4][0 - 9] | [01] ? [0 - 9][0 - 9] ?)$ /
//URL 
const url = /^((https?|ftp|file):\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/
//密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
const password /^.* (?=.{ 6,}) (?=.*\d) (?=.* [A - Z])(?=.* [a - z])(?=.* [!@#$%^&*? ]).* $ /
//XML判断
const xml = /^([a-zA-Z]+-?)+[a-zA-Z0-9]+\\.[x|X][m|M][l|L]$/

  //包含中文
  const chinese=/ [\u4E00 - \u9FA5] /
  //中文字符
 const zhongwen= /[^\x00-\xff]/
  //简单表情判断(未做测试)
const tt = / [\ud83c\udc00 -\ud83c\udfff] | [\ud83d\udc00 -\ud83d\udfff] | [\u2600 -\u27ff] /
 
//去掉空格换行
const cccc= ' s ds '.replace(/\s|' '|\n/g, "");
//金额输入 1000|1000.12
const ccssd=replace(/^(-)*(\d+)\.(\d\d).*$/, '$1$2.$3');
/**
 * @func 正则表达式
 */
const regex = {
  // 手机
  // mobile:/^0?(13|14|15|17|18)[0-9]{9}$/,
  mobile: /^1\d{10}$/,
  // 电话
  tel: /^[0-9-()（）]{7,18}$/,
  // 邮箱
  email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  // 身份证
  // 15位或者18位，15位时全为数字，18位前17位为数字，最后一位是校验位，可能为数字或字符X
  idcard: /(^\d{15}$)|(^\d{17}(\d|X|x)$)/,
  // 中文
  cn: /[\u4e00-\u9fa5]+$/,
  // 编号（已知：合同编号）
  code: /^[#*（）\-~《》/【】a-zA-Z0-9\u4E00-\u9FA5]+$/,
  // 税号
  taxnum: /^[a-zA-Z0-9]{15,20}$/,
  // excel文件
  excel: /^.+\.(xls|xlsx)$/,
};

export default regex;

